LEXICON: dict[str, str] = {
    "access_error": "Вы не можете получить доступ к этой команде, находясь в данной позиции. "
                    "Нажмите на кнопку ниже и введите команду",
    "exit_process": "Выход из процесса",
    "stop_all_processes": "Вы остановили все выполняемые процессы. Теперь вы можете ввести нужную команду"
}

LEXICON_COMMANDS: dict = {
    "/start": {
        "old_user": "Продолжаем работу! Мы вас уже знаем)",
        "new_user": "Вы добавлены в базу! Добро пожаловать))"
    },
    "/help": "Список команд:"
}
